Repository: ARM-software/tarmac-trace-utilities
Catalog: po/*/tarmac-trace-utilities.po
Languages: fr

source: register {} is not defined
fr: le registre {} n'est pas défini

source: (scroll up for more)
fr: (défiler vers le haut pour plus)

source: (scroll down for more)
fr: faire défiler vers le bas pour plus

source: Erase the last character
fr: Efface le dernier caractère

source: Erase the last word of the input line
fr: Efface le dernier mot de la ligne d'entrée

source: Erase the whole input line
fr: Efface toute la ligne d'entrée

source: Cancel the minibuffer input operation
fr: Annule l'opération d'entrée sur le mini-tampon

source: Accept the current minibuffer contents
fr: Accepte le contenu du mini-tampon

source: Tarmac file:
fr: fichier Tarmac:

source: Time:
fr: Temps:

source: Line:
fr: Ligne:

source: Step by one visible instruction
fr: Avance d'une instruction visible

source: Move by a screenful of visible trace
fr: Avance d'un écran de la trace visible

source: Jump to the start or end of the trace
fr: Saute au début ou à la fin de la trace

source: Scroll to cycle the current location between middle, top and bottom
fr: Faire défiler pour alterner entre le milieu, le dessus et le dessous

source: Jump to a specified time position
fr: Saute à une position à un temps spécifié

source: Jump to a specified line number of the trace file
fr: Saute à une ligne spécifiée dans le fichier de trace

source: Jump to the next / previous visit to a PC location
fr: Saute à la prochaine / précédente visite d'une valeur du PC

source: Toggle display of the core registers
fr: Active / désactive l'affichage des registres du cœur

source: Toggle display of the single / double FP registers
fr: Active / désactive l'affichage des registres simple / double précision

source: Open a memory view at a specified address
fr: Ouvre une vue de la mémoire à une adresse spécifiée

source: Highlight a single event within the current time
fr: Surligne un évènement au temps présent

source: Jump to the previous change to the memory accessed by the highlighted event
fr: Saute au changement précédent de la mémoire accédée par l'évènement surligné

source: Fold the innermost unfolded function call at this _position
fr: Plie l'appel de fonction non plié le plus profond at cette _position

source: Unfold the outermost folded function call at this position
fr: Déplie l'appel de fonction plié le plus à l'extérieur de cette position

source: Fold / unfold everything nested inside the innermost unfolded function call at this position
fr: Plie / déplie tout ce qui est niché à l'intérieur de l'appel de fonction dépliée le plus profond

source: Maximally fold / unfold the entire trace buffer
fr: Plie / déplie de façon maximale le tampon entier de trace

source: Toggle syntax highlighting
fr: Active / désactive la coloration syntaxique

source: Toggle symbolic display of branch targets
fr: Active / désactive l'affichage symbolique des cibles de branchement

source: No function call to fold up here
fr: Aucun appel de fonction à piler

source: No function call to unfold here
fr: Aucun appel de fonction à déplier

source: Go to time:
fr: Aller au temps:

source: Go to line:
fr: Aller à la ligne:

source: Go to previous visit to PC:
fr: Aller à la précédente visite du PC:

source: Go to next visit to PC:
fr: Aller à prochaine visite du PC:

source: Show memory at address:
fr: Afficher le contenu de la mémoire à l'adresse:

source: Syntax highlighting on
fr: Coloration syntaxique activée

source: Syntax highlighting off
fr: Coloration syntaxique désactivée

source: No image to look up symbolic branch targets
fr: Pas d'image dans laquelle rechercher les symboles des cibles des branchements

source: Symbolic branch-target display on
fr: Affichage symbolique des cibles des branchements activé

source: Symbolic branch-target display off
fr: Affichage symbolique des cibles des branchements désactivé

source: Error parsing expression: {}
fr: Erreur lors de l'analyse de l'expression: {}

source: Invalid format for parameter
fr: Format invalide pour le paramètre

source: use colour in the terminal
fr: Utilise la couleur dans le terminal

source: don't use colour in the terminal
fr: n'utilise pas la couleur dans le terminal

source: {}: {}: unable to parse colour '{}'
fr: {}: {}: impossible d'analyser la couleur '{}'

source: {}: {}: unrecognised config directive '{}'
fr: {}: {}: option de configuration non reconnue '{}'

source: Locked to:
fr: Verrouillé à:

source: None
fr: Vide

source: New trace view
fr: Vue d'une nouvelle trace

source: New...
fr: Nouvelle...

source: Memory view
fr: Vue mémoire

source: Stack view
fr: Vue de la pile

source: Core register view
fr: Vue des registres du cœur

source: Single-precision FP reg view
fr: Vue des registres simple précision

source: Double-precision FP reg view
fr: Vue des registres double précision

source: Neon vector reg view
fr: Vue des registre vecteur Neon

source: MVE vector reg view
fr: Vue des registres vecteur MVE

source: Find CPU exception...
fr: Trouve l'exception CPU...

source: Next
fr: Suivant

source: &View
fr: &Vue

source: Call-depth indentation
fr: Indentation suivant la profondeur d'appel

source: Syntax highlighting
fr: Coloration syntaxique

source: Symbolic branch targets
fr: Affichage symbolique des branchements

source: Time:
fr: Temps:

source: Prev
fr: Précédent

source: Fold all
fr: Tout plier

source: Unfold all
fr: Tout déplier

source: Containing call (lines {}–{} to {})
fr: Appel parent (lignes {}–{} à {})

source: Fold up
fr: Replier

source: Fold all subroutines
fr: Plier tous les fonctions appelées

source: Unfold completely
fr: Déplier complètement

source: Folded call (lines {}–{} to {})
fr: Appels pliés (lignes {}–{} à {})

source: Unfold one level
fr: Déplier d'un niveau

source: Memory access: {0} bytes at 0x{1:x}
fr: Accès mémoire: {0} octets à 0x{1:x}

source: Go to previous write
fr: Aller à l'écriture précédente

source: Open a memory window here
fr: Ouvre une vue mémoire ici

source: Register access: {}
fr: Accès registre: {}

source: Open memory window
fr: Ouvre une vue mémoire

source: Enter memory address to display
fr: Fournir l'adresse mémoire à afficher

source: Register {}
fr: Registre {}

source: Go to last write to this register
fr: Aller à la dernière écriture de ce registre

source: Core regs
fr: Registres du cœur

source: FP regs (single precision)
fr: Registres flottant (précision simple)

source: FP regs (double precision)
fr: Registres flottants (précision double)

source: Vector regs (Neon)
fr: Registres vecteur (Neon)

source: Vector regs (MVE)
fr: Registres vecteur (MVE)

source: Memory
fr: Mémoire

source: Address:
fr: Adresse

source: {0}-byte region at address 0x{1:x}
fr: région de {0}-octets à l'adresse 0x{1:x}

source: Go to last write to this region
fr: Aller à la dernière écriture dans cette région

source: tarmac-gui-browser fatal error
fr: erreur fatale dans tarmac-gui-browser

source: tarmac-gui-browser warning
fr: avertissement dans tarmac-gui-browser

source: Indexing trace file {0} to index file {1}
fr: Indexation du fichier de trace {0} vers le ficher d'index {1}

source: Indexing trace file {0}
fr: Indexation du fichier de trace {0}

source: (new index file)
fr: (nouveau fichier d'index)

source: (index file was older than trace file)
fr: (le fichier d'index était plus ancien que le fichier de trace)

source: (index file was not generated by this version of the tool)
fr: (le fichier d'index n'a pas été généré par cette version de l'outil)

source: (previous index file generation was not completed)
fr: (le fichier d'index précédent était incomplet)

source: (not actually indexing)
fr: (pas d'indexation)

source: tarmac-gui-browser indexing
fr: tarmac-gui-browser indexation

source: tarmac-gui-browser setup
fr: tarmac-gui-browser configuration

source: Trace file to view (required)
fr: Fichier de trace à afficher (requis)

source: Select a trace file to view
fr: Sélectionner un fichier de trace à afficher

source: ELF image matching the trace
fr: Fichier image ELF correspondant à la trace

source: Select an ELF image to use
fr: Sélectionner un fichier image ELF à utiliser

source: Re-index the trace file?
fr: Ré-indexation du fichier de trace ?

source: If necessary
fr: Si nécessaire

source: Always
fr: Toujours

source: Never
fr: Jamais

source: Trace is from a big-endian system
fr: La trace provient d'un system grand-boutiste

source: Unable to parse font description:
fr: Impossible d'analyser la description de fonte:

source: Setup error
fr: Erreur de configuration

source: Option name should be of the form '--foo' or '-f'
fr: Le nom de l'option doit être de la forme '--foo' ou '-f'

source: '--{}': unrecognised option name
fr: '--{}': nom d'option non reconnu

source: '--{}': option expects a value
fr: '--{}': l'option requiert une valeur

source: '--{}': option expects no value
fr: '--{}': l'option ne requiert aucune valeur

source: '-{}': unrecognised option name
fr: '-{}': nom d'option non reconnu

source: '-{}': option expects a value
fr: '-{}': l'option requiert une valeur

source: '{}': badly formatted option
fr: '{}': option mal formatée

source: '{}': unexpected positional argument
fr: '{}': argument positionnel inattendu

source: expected additional arguments (starting with '{}')
fr: d'autres arguments sont attendus (à partir de '{}')

source: try '{} --help' for help
fr: '{} --help' pour afficher l'aide

source: positional arguments:
fr: arguments positionnels:

source: also:
fr: aussi:

source: display this text
fr: affiche ce texte

source: No image, symbol '{}' can not be looked up !
fr: Pas d'image, le symbol '{}' ne peut être recherché !

source: Symbol '{}' not found !
fr: Symbole '{}' non trouve !

source: Symbol '{0}' at 0x{1:x} ({2} bytes) called from :
fr: Symbole '{0}' à 0x{1:x} ({2} octets) appelé depuis :

source: do not show an offset in call-tree records which start after the function entry point
fr: ne montre pas d'offset dans les enregistrements de l'arbre d'appel après l'appel du point d'entrée

source: register name '{}'
fr: nom du registre '{}'

source: expected an identifier after '::'
fr: identifiant requis après '::'

source: unrecognised register name '{}'
fr: nom de registre '{}' non reconnu

source: unrecognised symbol name '{}'
fr: nom de symbole '{}' non reconnu

source: unrecognised identifier scope '{}'
fr: identifiant de portée '{}' non reconnu

source: unrecognised identifier name '{}'
fr: nom d'identifiant '{}' non reconnu

source: expected closing ')'
fr: parenthèse fermante ')' requise

source: unexpected end of expression
fr: fin d'expression inattendue

source: unexpected token
fr: token inattendu

source: unexpected tokens after expression
fr: tokens inattendus après l'expression

source: Cannot open ELF file "%s"
fr: Impossible d'ouvrir l'image ELF "%s"

source: ignoring parse error on partial last line (trace truncated?)
fr: l'erreur d'analyze de la dernière ligne est ignorée (fichier de trace tronqué ?)

source: %s: magic number did not match
fr: %s: le nombre magique ne correspond pas

source: index file {} does not exist; building it
fr: le fichier d'index {} n'existe pas; démarrage de sa construction

source: index file {} is older than trace file {}; rebuilding it
fr: le fichier d'index {} est plus ancien que le fichier de trace {}; démarrage de sa reconstruction

source: index file {} was not generated by this version of the tool; rebuilding it
fr: le fichier d'index {} n'a pas été généré avec cette version de l'outil; démarrage de sa reconstruction

source: index file {} looks ok; not rebuilding it
fr: le fichier d'index {} semble OK; il ne sera pas reconstruit

source: Reading trace file ({}%)
fr: Lecture du fichier de trace ({}%)

source: Reading trace file (finished)
fr: Lecture du fichier de trace (terminé)

source: Out of memory
fr: Plus de mémoire

source: expected '(' to introduce instruction address and bit pattern
fr: '(' est attendu pour introduire une adresse d'instruction et un modèle de bits

source: expected a hex instruction address
fr: une adresse d'instruction au format hexadécimal est requise

source: expected ':' between instruction address and bit pattern
fr: ':' est requis entre une adresse d'instruction et un modèle de bits

source: expected a hex instruction bit pattern
fr: un modèle de bit au format hexadécimal est requis pour une instruction

source: expected ')' after instruction address and bit pattern
fr: une ')' est requise après une adresse d'instruction et un modèle de bits

source: expected a hex or decimal number
fr: un nombre au format hexadécimal ou décimal est requis

source: expected ')' after bracketed value
fr: une ')' est requise après une valeur entre parenthèses

source: expected a hex value
fr: une valeur au format hexadécimale est requise

source: expected a hex address after ':'
fr: une adresse au format hexadécimal est requise après ':'

source: expected a hex address after ','
fr: une adresse au format hexadecimal est requis après ','

source: expected instruction-set state
fr: un état du jeu d'instruction est requis

source: expected CPU mode
fr: mode du CPU requis

source: expected ':' before instruction
fr: un ':' est requis avant l'instruction

source: expected register name
fr: un nom de registre est attendu

source: unsupported system operation '{}'
fr: opération système non supportée '{}'

source: expected extra register identification details
fr: des détails d'identification supplémentaire du registre sont requis

source: expected ')' after extra register identification details
fr: une ')' est requise après les détails d'identification supplémentaire d'un registre

source: cannot handle register bit range for this register
fr: impossible de gérer l'interval de bits pour ce registre

source: expected bit offset within register
fr: un offset de bit dans le registre est requis

source: expected high bit offset within register to be at the top of a byte
fr: l'offset haut des bits du registre doit concerner l'octet le plus significatif

source: high bit offset is larger than containing register
fr: l'offset haut des bits est plus grand que le registre

source: expected ':' separating bit offsets in register bit range
fr: un ':' est requis pour séparer les offsets de bit dans l'interval de bit d'un registre

source: expected low bit offset within register to be at the bottom of a byte
fr: l'offset bas des bits du registre doit concerner l'octet le moins significatif

source: low bit offset is higher than high bit offset
fr: l'offset bas des bits est supérieur à l'offset haut des bits

source: expected '>' after register bit range
fr: un '>' est requis après l'interval de bits d'un registre

source: expected register contents
fr: le contenu du registre est requis

source: expected additional register contents after ':'
fr: contenu additionnel du registre requis après ':'

source: expected register contents to be an integer number of bytes
fr: le contenu d'un registre doit être un nombre entier d'octets

source: unrecognised {0}-bit register '{1}'
fr: registre {1} de {0} bit(s) non reconnu

source: expected memory address
fr: adresse mémoire requise

source: expected physical memory address after ':'
fr: adresse mémoire physique requise après ':'

source: expected closing parenthesis
fr: parenthèse fermante requise

source: unrecognised parenthesised keyword
fr: mot clé parenthésé non reconnu

source: expected memory contents in hex
fr: contenu de la mémoire requis au format hexadécimal

source: expected load/store memory address
fr: une adresse de lecture/écriture en mémoire est attendue

source: expected a word of data bytes, '.' and '#'
fr: un mot d'octets de données est attendu, '.' et '#'

source: expected data word to cover a whole number of bytes
fr: le mot de donnée doit couvrir le nombre entier d'octets

source: expected exactly 16 data bytes
fr: exactement 16 octets de données sont requis

source: expected each byte to be only one of '.', '#' and hex
fr: chacun des octets doit être '.', '#' ou hex

source: unknown Tarmac event type '{}'
fr: évènement Tarmac de type '{}' inconnu

source: IMAGEFILE
fr: FICHIERIMAGE

source: image file name
fr: nom du fichier contenant l'image

source: offset from addresses in the image file to addresses in the trace
fr: décalage des addresses dans l'image par rapport à celles de la trace

source: generate index and do nothing else
fr: génère uniquement l'index

source: regenerate index unconditionally
fr: re-génère l'index inconditionnellement

source: do not regenerate index
fr: ne pas générer l'index

source: keep index in memory instead of on disk
fr: garde l'index en mémoire plutôt que sur le disque

source: assume trace is from a little-endian platform
fr: suppose que la trace provient d'une plateforme petit-boutiste

source: assume trace is from a big-endian platform
fr: suppose que la trace provient d'une plateforme grand-boutiste

source: assume trace is from a Thumb-only platform and might omit the instruction set state from trace records
fr: considère que la trace provient d'une plateforme uniquement Thumb et peut omettre l'état du jeu d'instruction dans la trace

source: enable diagnostics of type TYPE (use --debug=list for a list)
fr: permet les diagnostiques de type TYPE (--debug=list pour avoir la liste)

source: List of diagnostic types:
fr: Liste des types de dignostiques

source: debug call and return analysis
fr: debug l'analyze des appels et retour

source: make tool more verbose
fr: rend l'outil plus verbeux

source: make tool quiet
fr: rend l'outil plus silencieux

source: force display of the progress meter
fr: force l'affichage de la barre de progression

source: INDEXFILE
fr: FICHIERINDEX

source: index file name
fr: nom du fichier d'index

source: TRACEFILE
fr: FICHIERTRACE

source: Tarmac trace file to read
fr: nom du fichier de trace Tarmac

source: Ignoring --no-index since index is in memory
fr: --no-index est ignoré car l'index est en mémoire

source: Ignoring index file name since index is in memory
fr: Le fichier d'index est ignoré puisque l'index est en mémoire

source: Tarmac trace files to read
fr: fichier de trace Tarmac à lire

source: Endianness mismatch between image and provided endianness
fr: Le boutisme de l'image ne correspond pas à celui spécifié

source: FUNCTION
fr: FONCTION

source: name or hex address of function to find calls to
fr: nom ou address hexadécimale de la fonction dont les appels sont à retrouver

source: expected at least one function name
fr: au moins un nom de fonction est requis

source: OUTFILE
fr: FICHIERSORTIE

source: write output to OUTFILE (default: standard output)
fr: écrit les résultats dans FICHIERSORTIE (défaut: sortie standard)

source: Node at file offset {}
fr: Nœud à l'offset de fichier {}

source: Node
fr: Nœud

source: Right child node
fr: Nœud fils de droite

source: Left child node
fr: Nœud fils de gauche

source: Root node
fr: Nœud racine

source: {:#x} at file offset {}:
fr: {:#x} à l'offset de fichier {}:

source: Child offsets
fr: Offsets fils

source: null
fr: zéro

source: Line range: start {}, extent {}
fr: Interval de lignes: début {}, fin {}

source: Byte range: start {:#x}, extent {:#x}
fr: Interval d'octets: début {:#x}, fin {:#x}

source: Modification time:
fr: Temps de modification:

source: invalid
fr: invalide

source: Root of memory tree:
fr: Racine de l'arbre mémoire

source: Call depth:
fr: Profondeur d'appel

source: sentinel
fr: sentinelle

source: {} lines, {} insns, left-crosslink {}, right-crosslink {}}}
fr: {} lignes, {} instructions, {} liaisons à gauche, {} liaisons à droite}}

source: Range:
fr: Interval:

source: register-space
fr: espace-registre

source: memory
fr: mémoire

source: Contents:
fr: Contenu:

source: memory subtree
fr: sous-arbre mémoire

source: memory subtree with root pointer at {:#x}, actual root is {:#x}
fr: sous arbre mémoire avec pointeur racine à {:#x}, racine courante {:#x}

source: Last modification:
fr: Dernière modification:

source: never
fr: jamais

source: line {}
fr: ligne {}

source: Latest modification time in whole subtree:
fr: Dernière temps de modification dans le sous-arbre complet:

source: Contents: {} bytes
fr: COntenu: {} octets

source: Contents: {} bytes at file offset {:#x}
fr: Contenu: {} octets à l'offset de fichier {:#x}

source: Line:
fr: Ligne:

source: - dependent on iflags
fr: - depend de iflags

source: '{}': unable to parse numeric value
fr: '{}': impossible d'analyser la valeur numérique

source: '{}': numeric value out of range
fr: '{}': la valeur numérique est hors de l'interval

source: Unable to find a node at line {}
fr: Nœud non trouvé à la ligne {}

source: Memory last modified at line {}:
fr: Dernière modification de la mémoire à la ligne {}:

source: {}, last modified at line {}:
fr: {}, modifié pour la dernière fois à la ligne {}

source: dump file header
fr: affiche l'entête de fichier

source: dump logical content of the sequential order tree
fr: affiche le contenu logique de l'arbre d'ordre séquentiel

source: dump logical content of the sequential order tree, and memory contents at each node
fr: affiche le contenu logique de l'arbre d'ordre séquentiel ainsi que le contenu de la mémoire pour chaque nœud

source: dump physical structure of the sequential order tree
fr: affiche la structure physique de l'arbre d'ordre séquentiel

source: dump logical content of memory tree with root at OFFSET
fr: affiche le contenu logique de l'arbre mémoire dont la racine est OFFSET

source: dump physical structure of a memory tree with root at OFFSET
fr: affiche la structure physique d'un arbre mémoire dont la racine est OFFSET

source: dump logical content of a memory subtree with root at OFFSET
fr: affiche le contenu logique d'un sous-arbre mémoire dont la racine est OFFSET

source: dump physical structure of a memory subtree with root at OFFSET
fr: affiche la structure physique d'un sous-arbre mémoire dont la racine est OFFSET

source: dump logical content of the by-PC tree
fr: affiche le contenu logique de l'arbre by-PC

source: dump physical structure of the by-PC tree
fr: affiche la structure physique de l'arbre by-PC

source: write a memory map of the register space
fr: affiche une carte mémoire de l'espace registre

source: FLAGS
fr: DRAPEAUX

source: (for --regmap) specify iflags context to retrieve registers
fr: (pour --regmap) spécifie le context iflags pour récupérer les registres

source: do not dump offsets in index file (so that output is more stable when index format changes)
fr: ne stocke pas les offset dans le fichier de trace (de façon que la sortie soit plus stable quand le format de l'index change)

source: dump full content of memory tree corresponding to a particular line of the trace file
fr: affiche le contenu complet de l'arbre mémoire correspondant à une ligne particulière du fichier de trace

source: expected an option describing a query
fr: une option décrivant la requête est attendue

source: expected a trace file name
fr: un nom de fichier de trace est requis

source: Endianness:
fr: Boutisme:

source: big
fr: grand

source: little
fr: petit

source: Thumb only:
fr: Thumb uniqument

source: Largest SVE vector register access:
fr: Accès registre SVE le plus large:

source: Root of sequential order tree:
fr: Racine de l'arbre d'ordre séquentiel

source: Root of by-PC tree:
fr: Racine de l'arbre by-PC

source: Line number adjustment for file header:
fr: Ajustement du nombre de lignes pour l'entête de fichier

source: Address
fr: Adresse

source: Count
fr: Compte

source: Time
fr: Temps

source: Function name
fr: Nom de fonction

source: unable to open input file '%s'
fr: impossible d'ouvrir le fichier d'entrée '%s'

source: unable to open output file '%s'
fr: impossible d'ouvrir le fichier de sortie '%s'
