Repository: ARM-software/tarmac-trace-utilities
Catalog: po/*/tarmac-trace-utilities.po
Languages: fr

source: Error: too many memory accesses in instruction at timestamp %llu - more than the %llu that can be represented in the VCD output.
fr: Erreur: trop d'accés mémoire par l'instruction au tem %llu - plus que les %llu qui peuvent être représentés dans la sortie VCD

source: Error: tarmac trace is not chronologically ordered (time %llu follows time %llu).
fr: Erreur: la trace tarmac n'est pas ordonnée chronologiquement (le temps %llu suit le temps %llu).

source: Warning: time is not increasing strictly monotonically between instructions at time %llu. You should consider *not* using option --use-tarmac-timestamps.
fr: Attention: le temps n'augmente pas de façon strictement monotonique entre les instructions au temps %llu. Vous devriez considerer de *ne pas* utiliser l'option --use-tarmac-timestamps.

source: VCDFILE
fr: FICHIERVCD

source: VCD file name (default: tarmac_filename.vcd)
fr: nom du fichier VCD (défaut: tarmac_filename.vcd)

source: Do not emit the date field in the vcd file
fr: Ne pas émettre le champs date dans le fichier vcd

source: Use the instructions' timestamps from the tarmac trace.
fr: utilise the la marque de temps de la trace tarmac
